In [2]:
from operator import index

import pandas as pd
import numpy as np

In [3]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [4]:
# Removendo 'c' da série
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [6]:
# Removendo 'c' e 'd' da série
obj.drop(['c', 'd'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [7]:
# Removendo valores de um DataFrame
data = pd.DataFrame(np.arange(16).reshape(4,4),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [9]:
# Chamando drop com sequência de rótulos para remover valores
data.drop(['Ohio', 'Colorado'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [10]:
# Removendo colunas
data.drop(columns='two')

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [11]:
# Removendo usando axis
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [12]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14